<?php

use yii\db\Migration;

/**
 * Class m220920_094248_CreateTableAbcDefGmt
 */
class m220920_094248_CreateTableAbcDefGmt extends Migration
{

    private const REGIONS = [
        'Московская область' => 'UTC+3',
        'Ленинградская область' => 'UTC+3',
        'Свердловская область' => 'UTC+5',
        'Республика Башкортостан' => 'UTC+5',
        'Республика Татарстан' => 'UTC+3',
        'Иркутская область' => 'UTC+8',
        'Красноярский край' => 'UTC+7',
        'Новосибирская область' => 'UTC+7',
        'Самарская область' => 'UTC+4',
        'Российская Федерация' => 'UTC+3',
        'Кемеровская область' => 'UTC+7',
        'Тюменская область' => 'UTC+5',
        'Ивановская область' => 'UTC+3',
        'Алтайский край' => 'UTC+7',
        'Республика Алтай' => 'UTC+7',
        'Ростовская область' => 'UTC+3',
        'Краснодарский край' => 'UTC+3',
        'Калининградская область' => 'UTC+3',
        'Республика Крым' => 'UTC+3',
        'Пермский край' => 'UTC+5',
        'Челябинская область' => 'UTC+5',
        'Республика Удмуртская' => 'UTC+4',
        'Нижегородская область' => 'UTC+3',
        'Саратовская область' => 'UTC+3',
        'Ханты-Мансийский' => 'UTC+5',
        'Ханты-Мансийский АО - Югра' => 'UTC+5',
        'Ханты-Мансийский - Югра АО' => 'UTC+5',
        'Республика Коми' => 'UTC+3',
        'Волгоградская область' => 'UTC+4',
        'Воронежская область' => 'UTC+3',
        'Тверская область' => 'UTC+3',
        'Республика Саха' => 'UTC+9',
        'Ямало-Ненецкий АО' => 'UTC+5',
        'Ненецкий АО' => 'UTC+3',
        'Тульская область' => 'UTC+3',
        'Ставропольский край' => 'UTC+3',
        'Архангельская область' => 'UTC+3',
        'Рязанская область' => 'UTC+3',
        'Курская область' => 'UTC+3',
        'Мурманская область' => 'UTC+3',
        'Калужская область' => 'UTC+3',
        'Белгородская область' => 'UTC+3',
        'Вологодская область' => 'UTC+3',
        'Ульяновская область' => 'UTC+4',
        'Курганская область' => 'UTC+5',
        'Смоленская область' => 'UTC+3',
        'Ярославская область' => 'UTC+3',
        'Приморский край' => 'UTC+10',
        'Оренбургская область' => 'UTC+5',
        'Брянская область' => 'UTC+3',
        'Орловская область' => 'UTC+3',
        'Владимирская область' => 'UTC+3',
        'Псковская область' => 'UTC+3',
        'Томская область' => 'UTC+7',
        'Томбовская область' => 'UTC+3',
        'Костромская область' => 'UTC+3',
        'Новгородская область' => 'UTC+3',
        'Кировская область' => 'UTC+3',
        'Республика Чувашская' => 'UTC+3',
        'Чувашская Республика - Чувашия' => 'UTC+3',
        'Чувашская Республика' => 'UTC+3',
        'Республика Мордовия' => 'UTC+3',
        'Забайкальский край' => 'UTC+9',
        'Северная Осетия' => 'UTC+3',
        'Амурская область' => 'UTC+9',
        'Хабаровский край' => 'UTC+10',
        'Республика Бурятия' => 'UTC+8',
        'Астраханская область' => 'UTC+4',
        'Пензенская область' => 'UTC+3',
        'Республика Марий Эл' => 'UTC+3',
        'Липецкая область' => 'UTC+3',
        'Республика Карелия' => 'UTC+3',
        'Чеченская Республика' => 'UTC+3',
        'Республика Дагестан' => 'UTC+3',
        'Сахалинская область' => 'UTC+11',
        'Республика Хакасия' => 'UTC+7',
        'Тамбовская область' => 'UTC+3',
        'Республика Адыгея' => 'UTC+3',
        'Республика Калмыкия' => 'UTC+3',
        'Камчатский край' => 'UTC+12',
        'Кабардино-Балкарская Республика' => 'UTC+3',
        'Республика Кабардино-Балкарская' => 'UTC+3',
        'Карачаево-Черкесская Республика' => 'UTC+3',
        'Республика Карачаево-Черкесская' => 'UTC+3',
        'Республика Тыва' => 'UTC+7',
        'Еврейская АО' => 'UTC+10',
        'Магаданская область' => 'UTC+11',
        'Чукотский АО' => 'UTC+12',
        'Республика Ингушетия' => 'UTC+3',
        'Дальневосточный федеральный округ' => 'UTC+10',
        'Сибирский федеральный округ' => 'UTC+7',
        'Кемерово область' => 'UTC+7',
        'Казахстан' => 'UTC+5',
        'Уральский федеральный округ' => 'UTC+5',
        'Еврейская автономная область' => 'UTC+10',
        'Центральный федеральный округ' => 'UTC+3',
        'Северо-Западный федеральный округ' => 'UTC+3',
        'Республика Северная Осетия - Алания' => 'UTC+3',
        'Омская область' => 'UTC+6',
        'Республика Чеченская' => 'UTC+3',
        'Республика Удмуртия' => 'UTC+4',
        'Удмуртская Республика' => 'UTC+4',
        'Республика Казахстан' => 'UTC+3'
    ];


    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->createTable('abc_def_gmt', [
                'uuid' => 'uuid not null unique',
                'region' => $this->string()->notNull()->unique(),
                'offset' => $this->string()->notNull()
            ]
        );

        foreach (self::REGIONS as $region => $gmt) {
            $this->insert('abc_def_gmt', ['region' => $region, 'offset' => $gmt, 'uuid' => \Ramsey\Uuid\Uuid::uuid4()->toString()]);
        }
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropTable('abc_def_gmt');
    }
}